
&НаКлиенте
Процедура КомандаПеремещениеПоказателей(Команда)
	 
ПоказательГруппа = Неопределено;
Если Элементы.Список.ТекущиеДанные <> неопределено Тогда
ПоказательГруппа = элементы.Список.ТекущаяСтрока;	

КонецЕсли;  

Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормы", ЭтаФорма, Параметры);

П = Новый Структура("ПоказательГруппа",элементы.Список.ТекущаяСтрока);	
Открытьформу("Справочник._СтаьтяДДС.Форма.ФормаПерестановки",П,Этотобъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры



&НаКлиенте
Процедура ПослеЗакрытияФормы(Результат, Параметры) Экспорт
	
	Элементы.Список.Обновить();
КонецПроцедуры

