&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если 
		НЕ Параметры.Свойство("Ссылка") ИЛИ НЕ ЗначениеЗаполнено(Параметры.Ссылка) 
	Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	ДокументСсылка = Параметры.Ссылка;
	СуммаДокумента = ДокументСсылка.СуммаПлатежа;
	ДатаПервойОплаты = ДокументСсылка.ДатаОплаты;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИЗакрытьНаСервере()
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("СоздаватьДокументы", Истина);
	//СтруктураПараметров.Вставить("РазбивкаНаЭтапыОплаты", РазбивкаНаЭтапыОплаты);
	//ЭтаФорма.Закрыть(СтруктураПараметров);	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьНаЭтапыНаКлиенте(ТекущийЭтап = 0)
	
	Если ТекущийЭтап = 0 Тогда
		РазбивкаНаЭтапыОплаты.Очистить();
		ПервыйЭтап = 1;
	Иначе 
		ПервыйЭтап = ТекущийЭтап;	
	КонецЕсли;
	
	СуммаКРаспределению = СуммаДокумента;
	
	Для Этап = 1 По КоличествоЭтапов Цикл
		
		Если ТекущийЭтап = 0 Тогда
			НС = РазбивкаНаЭтапыОплаты.Добавить();
			Если ЗначениеЗаполнено(ДатаПервойОплаты) Тогда
				НС.ДатаОплаты	 = ДобавитьМесяц(ДатаПервойОплаты, Этап - 1);
			КонецЕсли;
			НС.НомерСтроки = Этап;
		Иначе
			НС = РазбивкаНаЭтапыОплаты[Этап - 1];
		КонецЕсли;
		
		Если Этап > ТекущийЭтап Тогда
			//пересчет сумм
			НС.Сумма		 = Окр(СуммаКРаспределению / (КоличествоЭтапов - ТекущийЭтап), 2);
			НС.Процент		 = НС.Сумма / СуммаДокумента * 100;
		Иначе
			СуммаКРаспределению = СуммаКРаспределению - НС.Сумма;
		КонецЕсли;
	
		Если Этап = КоличествоЭтапов Тогда
			//корректируем остаток
			НС.Сумма 	= НС.Сумма + СуммаДокумента - РазбивкаНаЭтапыОплаты.Итог("Сумма");
			НС.Процент	= НС.Процент + 100 - РазбивкаНаЭтапыОплаты.Итог("Процент");
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СоздаватьДокументы", Истина);
	СтруктураПараметров.Вставить("РазбивкаНаЭтапыОплаты", РазбивкаНаЭтапыОплаты);
	ЭтаФорма.Закрыть(СтруктураПараметров);	
//	СохранитьИЗакрытьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазбитьНаЭтапы(Команда)
	РазбитьНаЭтапыНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура РазбивкаНаЭтапыОплатыСуммаПриИзмененииНаКлиенте()
    НС = Элементы.РазбивкаНаЭтапыОплаты.ТекущиеДанные;
	НС.Процент	= НС.Сумма / СуммаДокумента * 100;
	РазбитьНаЭтапыНаКлиенте(НС.НомерСтроки);
КонецПроцедуры


&НаКлиенте
Процедура РазбивкаНаЭтапыОплатыСуммаПриИзменении(Элемент)
	РазбивкаНаЭтапыОплатыСуммаПриИзмененииНаКлиенте();
КонецПроцедуры

