

&НаКлиенте
Процедура КППриИзменении(Элемент)
ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
Список, "Ссылка", КП, ВидСравненияКомпоновкиДанных.Равно,, Истина);

	
КонецПроцедуры

&НаКлиенте
Процедура ИнициаторПриИзменении(Элемент)
ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
Список, "Инициатор", Инициатор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Инициатор));
	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
Параметры.Свойство("КП",КП);

Если Не ЗначениеЗаполнено( КП) Тогда
КП =  _ОбщийМодульВызовСервера.ПолучитьПоследнийКП()
КонецЕсли;
ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
Список, "Ссылка", КП, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	
Параметры.Свойство("Инициатор",Инициатор);
ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
Список, "Инициатор", Инициатор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Инициатор));
	
ТекущийПользователь = Пользователи.ТекущийПользователь();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("КП",КП);
	ПараметрыЗакрытия.Вставить("СтатьяДДС",Элементы.Список.ТекущиеДанные.СтатьяДДС);
	ПараметрыЗакрытия.Вставить("Плательщик",Элементы.Список.ТекущиеДанные.Плательщик);
	ПараметрыЗакрытия.Вставить("Инициатор",Элементы.Список.ТекущиеДанные.Инициатор);
	ПараметрыЗакрытия.Вставить("СуммаПлатежа",Элементы.Список.ТекущиеДанные.СуммаПлатежа);
	ПараметрыЗакрытия.Вставить("ДатаПлатежа",Элементы.Список.ТекущиеДанные.ДатаПлатежа);
	ПараметрыЗакрытия.Вставить("ЦФО",Элементы.Список.ТекущиеДанные.ЦФО);
	ПараметрыЗакрытия.Вставить("Примечание",Элементы.Список.ТекущиеДанные.Примечание);
    ПараметрыЗакрытия.Вставить("ТребованиеКСогласованию",Элементы.Список.ТекущиеДанные.ТребованиеКСогласованию);


	ОповеститьОВыборе(ПараметрыЗакрытия);
	
	
КонецПроцедуры


&НаКлиенте
Процедура МоиПлатежи(Команда)
	Инициатор = ТекущийПользователь;
	ИнициаторПриИзменении(Неопределено)

КонецПроцедуры
