
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения._ДвиженияДенежныхСредств.Записывать = Истина;

	// регистр _Бюджет Приход
	Для Каждого ТекСтрокаПлатежи Из Платежи Цикл
		Движение = Движения._ДвиженияДенежныхСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.КалендарныйПлатеж =Ссылка;
		Движение.Плательщик =Плательщик;
		Движение.Инициатор =ТекСтрокаПлатежи.Инициатор;
		Движение.ЦФО = ТекСтрокаПлатежи.ЦФО;
		Движение.СтатьяДДС = ТекСтрокаПлатежи.СтатьяДДС;
		Движение.СуммаПлатежа = ТекСтрокаПлатежи.СуммаПлатежа;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
		ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	
КонецПроцедуры
