
&НаКлиенте
Процедура ОрганизацияНажатие(Элемент, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	СтандартнаяОбработка=Ложь;
	
	ЗначениеОтбора = Новый Структура("Организация", ТекСтрока.Организация);
	ОткрытьФормуМодально("РегистрСведений._СогласователиОрганизации.Форма.ФормаСпискаПолная",ЗначениеОтбора);
	

	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОрганизацию(Команда)
	
	Организация="";
	ВвестиЗначение(Организация,"Выберите организацию",Тип("СправочникСсылка._Организации"));
	Если Организация="" Тогда
		Возврат;
	КонецЕсли;
	ПроверитьДобавитьОрганизацию(Организация);
	Элементы.Список.Обновить();	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДобавитьОрганизацию(Организация)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_СогласователиОрганизации.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений._СогласователиОрганизации КАК _СогласователиОрганизации
	               |ГДЕ
	               |	_СогласователиОрганизации.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	
	Рег = РегистрыСведений._СогласователиОрганизации.СоздатьНаборЗаписей();
	Рег.Отбор.Организация.Установить(Организация);
	Рег.Прочитать();
	НовСтр = рег.Добавить();
	НовСтр.Организация = Организация;
	Рег.Записать();
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Организация = ТекСтрока.Организация;
	УдалитьОрганизацию(Организация);
	Элементы.Список.Обновить();	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОрганизацию(Организация);
	
	  
	Рег = РегистрыСведений._СогласователиОрганизации.СоздатьНаборЗаписей();
	Рег.Отбор.Организация.Установить(Организация);
	Рег.Прочитать();
	Рег.Очистить();
	Рег.Записать();

	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Организация="";
	ВвестиЗначение(Организация,"Выберите организацию, куда копируем",Тип("СправочникСсылка._Организации"));
	Если Организация="" Тогда
		Возврат;
	КонецЕсли;
	ПроверитьСкопироватьОрганизацию(Организация,ТекСтрока.Организация);
	Элементы.Список.Обновить();	
	

	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСкопироватьОрганизацию(ОрганизацияКуда, ОрганизацияОткуда)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_СогласователиОрганизации.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений._СогласователиОрганизации КАК _СогласователиОрганизации
	               |ГДЕ
	               |	_СогласователиОрганизации.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", ОрганизацияКуда);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	РегКуда = РегистрыСведений._СогласователиОрганизации.СоздатьНаборЗаписей();
	РегКуда.Отбор.Организация.Установить(ОрганизацияКуда);
	РегКуда.Прочитать();

	
	Рег = РегистрыСведений._СогласователиОрганизации.СоздатьНаборЗаписей();
	Рег.Отбор.Организация.Установить(ОрганизацияОткуда);
	Рег.Прочитать();
	
	Для Каждого СтрокаРег из Рег цикл
		
		
		НовСТР = РегКуда.Добавить();
		НовСТР.Организация = ОрганизацияКуда;
		НовСТР.Пользователь = СтрокаРег.Пользователь;
		НовСТР.Пользователь2 = СтрокаРег.Пользователь2;
		НовСТР.СтатьяДДС = СтрокаРег.СтатьяДДС;
		
		
	КонецЦикла;
	
	РегКуда.Записать();
	
	
КонецПроцедуры
