

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПочтовыйКлиентПриИзменении(Элемент)
	НаборКонстант.ИспользоватьШаблоныСообщений = НаборКонстант.ИспользоватьПочтовыйКлиент;
	НаборКонстант.ОтправлятьПисьмаВФорматеHTML =  НаборКонстант.ИспользоватьПочтовыйКлиент;
	НаборКонстант._СоздатьИсходящееПисьмоПриИзмененииСтатуса =  НаборКонстант.ИспользоватьПочтовыйКлиент;
	УстановитьДоступность();


КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()

Элементы._ОтправлятьСообщенияСразуПриИзмененииСтатуса.Видимость = НаборКонстант.ИспользоватьПочтовыйКлиент и НаборКонстант._СоздатьИсходящееПисьмоПриИзмененииСтатуса;	
	
Элементы._СоздатьИсходящееПисьмоПриИзмененииСтатуса.Видимость =НаборКонстант.ИспользоватьПочтовыйКлиент;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура _СоздатьИсходящееПисьмоПриИзмененииСтатусаПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры
