Процедура ПриДобавленииПодсистемы(Описание) Экспорт 
	//  имя конфигурации и номер версии на 
	Описание.Имя = "Согласование";
	Описание.Версия = "1.0.1.5";
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
КонецПроцедуры 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт 
    Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.УправлениеОбработчиками = Истина;
	Обработчик.МонопольныйРежим = истина; // Для демонстрации условного выполнения в монопольном режиме.
	Обработчик.Процедура = "_ОбновлениеИнформационнойБазыСогласование.ВыполнятьВсегдаПриСменеВерсии";
	
КонецПроцедуры
Процедура ПередОбновлениемИнформационнойБазы() 	Экспорт 
	
КонецПроцедуры
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия, Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
КонецПроцедуры 
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
КонецПроцедуры 
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
КонецПроцедуры
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
КонецПроцедуры 
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт 
КонецПроцедуры


Процедура ВыполнятьВсегдаПриСменеВерсии(Параметры = Неопределено) Экспорт

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСообщений.Ссылка КАК Ссылка,
		|	ШаблоныСообщений.Назначение КАК Назначение
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.Предопределенный = ИСТИНА";
	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока  ВыборкаДетальныеЗаписи.Следующий() Цикл
	Об = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();	
	Об.ПредназначенДляSMS = ложь;
	Об.ПредназначенДляВводаНаОсновании = Истина;
	Об.ПредназначенДляЭлектронныхПисем  = Истина;
	Об.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	//Об. Назначение= 
	Об.Записать();
	КонецЦикла;


КонецПроцедуры

