
Функция ДоступРазрешен(Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	_ГруппыДоступа.ЗначениеДоступа
		|ИЗ
		|	РегистрСведений._ГруппыДоступа КАК _ГруппыДоступа
		|ГДЕ
		|	_ГруппыДоступа.Пользователь = &Пользователь
		|	И _ГруппыДоступа.ЗначениеДоступа = &ЗначениеДоступа";
	
	Запрос.УстановитьПараметр("ЗначениеДоступа", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции