
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗСписок.Очистить();
	
	Организация = Параметры.Организация;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_СогласователиОрганизации.Организация КАК Организация,
	               |	_СогласователиОрганизации.Пользователь КАК Пользователь,
	               |	_СогласователиОрганизации.СтатьяДДС КАК СтатьяДДС,
	               |	_СогласователиОрганизации.Пользователь2 КАК Пользователь2
	               |ИЗ
	               |	РегистрСведений._СогласователиОрганизации КАК _СогласователиОрганизации
	               |ГДЕ
	               |	_СогласователиОрганизации.Организация = &Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	_СогласователиОрганизации.СтатьяДДС.Наименование";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		НовСтр = ТЗСписок.Добавить();
		НовСтр.СтатьяДДС = Выборка.СтатьяДДС;
		НовСтр.Пользователь = выборка.Пользователь;
		НовСтр.Пользователь2 = Выборка.Пользователь2;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ТЗСписокПриИзмененииНаСервере()
	
	
	Рег = РегистрыСведений._СогласователиОрганизации.СоздатьНаборЗаписей();
	Рег.Отбор.Организация.Установить(Организация);
	Рег.Прочитать();
	Рег.Очистить();

	Для Каждого СтрокаТЧ из ТЗСписок цикл
		
				
		НовСтр = рег.Добавить();
		НовСтр.Организация = Организация;
		НовСтр.Пользователь = СтрокаТЧ.Пользователь;
		НовСтр.Пользователь2 = СтрокаТЧ.Пользователь2;
		НовСтр.СтатьяДДС = СтрокаТЧ.СтатьяДДС;
		
		
	КонецЦикла;
	
	Попытка
		Рег.Записать();
	Исключение
	КонецПопытки;
	
	
	
	
	
	
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТЗСписокПриИзменении(Элемент)
	ТЗСписокПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЗСписокПослеУдаления(Элемент)
	
	ТЗСписокПриИзмененииНаСервере();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ОчиститьИЗаполнитьПоВсемСтатьямНаСервере()
	
	ТЗСписок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_СтаьтяДДС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник._СтаьтяДДС КАК _СтаьтяДДС
	               |ГДЕ
	               |	_СтаьтяДДС.ЭтоГруппа = ЛОЖЬ
	               |	И _СтаьтяДДС.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	_СтаьтяДДС.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		
		НовСтр = ТЗСписок.Добавить();
		НовСтр.СтатьяДДС = выборка.ссылка;
		
	КонецЦикла;
	
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИЗаполнитьПоВсемСтатьям(Команда)
	ОчиститьИЗаполнитьПоВсемСтатьямНаСервере();
КонецПроцедуры
