
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ИНН = Объект.ИНН;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_Контрагенты.ИНН КАК ИНН,
		|	_Контрагенты.Код КАК Код
		|ИЗ
		|	Справочник._Контрагенты КАК _Контрагенты
		|ГДЕ
		|	_Контрагенты.ИНН = &ИНН
		|	И _Контрагенты.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("Ссылка", объект.Ссылка);
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() тогда 
	    Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Контрагент с данным ИНН уже существует";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;				
	Конецесли;

КонецПроцедуры
