

&НаКлиенте
Процедура ПокзательГруппаПриИзменении(Элемент)
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПерестановкуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПерестановку(Команда)
	ВыполнитьПерестановкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаДалее(Команда)
	Если Элементы.Страница1.Видимость = Истина Тогда
	УстановитьВидимостьСтраницы2();
	ИначеЕсли  Элементы.Страница2.Видимость = Истина Тогда
	ЗавершитьОперацию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
Если  Элементы.Страница2.Видимость = Истина Тогда
УстановитьВидимостьСтраницы1();
КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтраницы1()

Элементы.Страница1.Видимость = Истина;
Элементы.Страница2.Видимость = Ложь;	
Элементы.КомандаДалее.Видимость = Истина;
Элементы.КомандаНазад.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтраницы2()

	
	
Элементы.Страница1.Видимость = Ложь;
Элементы.Страница2.Видимость = Истина;		
ЗаполнитьНовыйКодНаКлиенте();

Элементы.КомандаДалее.Видимость = Истина;
Элементы.КомандаНазад.Видимость = Истина;


КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНовыйКодНаКлиенте1()

Для х= 0 по Таблица.Количество()-1 цикл

Таблица[х].Новыйкод = ИсходнаяТаблица[х].Код;

	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНовыйКодНаКлиенте()
КодГруппы=  ПоучитьКодНасрвере();
Если ЗначениеЗаполнено (КодГруппы) Тогда
Код1 = Лев(КодГруппы,2);
Код2= Сред(КодГруппы,4,2);
Код3= Сред(КодГруппы,7,2);

	
Иначе

Код1 = "";
Код2= "";
Код3= "";


КонецЕсли;
Сч=0;

Для каждого Стр из Таблица цикл
Сч = Сч+1;	

Если Не ЗначениеЗаполнено(Код1) Тогда
	НовыйКод = ДобавитьНули(Сч);
ИначеЕсли ЗначениеЗаполнено(Код1) и не ЗначениеЗаполнено(Код2)  Тогда
	НовыйКод = Код1+"."+ ДобавитьНули(Сч); 
	
ИначеЕсли  ЗначениеЗаполнено(Код1) и  ЗначениеЗаполнено(Код2) и  не ЗначениеЗаполнено(Код3) Тогда
	НовыйКод = Код1+"."+ Код2+"."+ДобавитьНули(Сч)
	
ИначеЕсли  ЗначениеЗаполнено(Код1) и  ЗначениеЗаполнено(Код2) и  ЗначениеЗаполнено(Код3) Тогда
	НовыйКод = Код1+"."+ Код2+"."+ Код3+"."+ ДобавитьНули(Сч)
иначе	
	
	НовыйКод = Код1+"."+ Код2+"."+ Код3+"."+ ДобавитьНули(Сч)

КонецЕсли;		

Стр.Новыйкод = НовыйКод;

	КонецЦикла;	

КонецПроцедуры

&НаСервере
Функция ПоучитьКодНасрвере()

Возврат ?(ЗначениеЗаполнено(ПоказательГруппа),ПоказательГруппа.Код,""); 

КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если  ЗначениеЗаполнено(Параметры.ПоказательГруппа) Тогда
		Если Параметры.ПоказательГруппа.ЭтоГруппа Тогда	
			
			ПоказательГруппа = Параметры.ПоказательГруппа;
		Иначе
			ПоказательГруппа = Параметры.ПоказательГруппа.Родитель;
			
		КонецЕсли;
	КонецЕсли;
ЗаполнитьТаблицуНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()

	 КодГруппы=  ПоучитьКодНасрвере();
	
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_СтаьтяДДС.Код КАК Код,
		|	_СтаьтяДДС.Ссылка КАК Показатель
		|ИЗ
		|	Справочник._СтаьтяДДС КАК _СтаьтяДДС
		|ГДЕ
		|	_СтаьтяДДС.Родитель = &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	Запрос.УстановитьПараметр("Родитель", ПоказательГруппа);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	  Таблица.Очистить();
	  ИсходнаяТаблица.Очистить();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	ЗаполнитьЗначенияСвойств(Таблица.Добавить(),ВыборкаДетальныеЗаписи);
	ЗаполнитьЗначенияСвойств(ИсходнаяТаблица.Добавить(),ВыборкаДетальныеЗаписи);

		
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОперацию()

	  Режим = РежимДиалогаВопрос.ДаНет;
Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
ПоказатьВопрос(Оповещение, "Зафиксировать перестановку кодов и заверщить операцию?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ЗавершитьОперациюНасервере();
	Закрыть();
	
  

КонецПроцедуры

&НаСервере
Процедура ЗавершитьОперациюНасервере()

Для каждого Стр Из Таблица Цикл
  
	  Если  Стр.Новыйкод  <>  Стр.Код   Тогда
	  
	Об = Стр.Показатель.ПолучитьОбъект();
	Об.Код = Стр.Новыйкод;
	Об.Записать();
	  КонецЕсли; 			  
  КонецЦикла; //...
	

КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьСтраницы1();

КонецПроцедуры

&НаКлиенте
Функция ДобавитьНули(Значение)
	Если Значение < 10 Тогда
		Возврат "0"+Строка(Значение);	
		
	иначе
		Возврат Строка(Значение); 
	КонецЕсли;
	
      
КонецФункции
